#include <stdint.h>

int main(void)
{
    *(uint32_t*)(0x40023800UL + 0x30UL) |= 0x02UL; // включение тактирования GPIOB
    *(uint32_t*)(0x40030400UL + 0x00UL) |= 0x4000UL; // включение режима работы пина PB7
    *(uint32_t*)(0x40020400UL + 0x04UL) |= 0x00UL; // зануление режимов работы вывода, регистр
    *(uint32_t*)(0x40020400UL + 0x08UL) |= 0x4000UL; // настройка регистра OSPEED скорости (скорость средняя)
    *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x80UL; // Включает светодиод, BSSR

    while (1){}
}
